IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu1_sys_regs.xml
	<register id="PCLKCR19" width="32" page="1" offset="0x36" internal="0" description="Peripheral Clock Gating Register - LIN">
		<bitfield id="LIN_A" description="LIN_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR21" width="32" page="1" offset="0x3a" internal="0" description="Peripheral Clock Gating Register - DCC">
		<bitfield id="DCC0" description="DCC0 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 Clock Enable Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 Clock Enable Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR23" width="32" page="1" offset="0x3e" internal="0" description="Peripheral Clock Gating Register - EtherCAT">
		<bitfield id="ETHERCAT" description="ETHERCAT Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR25" width="32" page="1" offset="0x42" internal="0" description="Peripheral Clock Gating Register - HRCAL0,1,2">
		<bitfield id="HRCAL0" description="HRCAL0 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL1" description="HRCAL1 Clock Enable Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL2" description="HRCAL2 Clock Enable Bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR26" width="32" page="1" offset="0x44" internal="0" description="Peripheral Clock Gating Register - AES">
		<bitfield id="AESA" description="AESA Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR27" width="32" page="1" offset="0x46" internal="0" description="Peripheral Clock Gating Register - EPG">
		<bitfield id="EPG1" description="EPG1 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR28" width="32" page="1" offset="0x48" internal="0" description="Peripheral Clock Gating Register - ADCCHECKER">
		<bitfield id="ADCCHECKER1" description="ADCCHECKER1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER2" description="ADCCHECKER2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER3" description="ADCCHECKER3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER4" description="ADCCHECKER4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER5" description="ADCCHECKER5 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER6" description="ADCCHECKER6 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER7" description="ADCCHECKER7 Clock Enable bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER8" description="ADCCHECKER8 Clock Enable bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU1" description="ADCSEAGGRCPU1 Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SIMRESET" width="32" page="1" offset="0x60" internal="0" description="Simulated Reset Register">
		<bitfield id="CPU1RSn" description="Generates a reset to CPU" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XRSn" description="Generates a simulated XRSn" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key value to enable write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="LPMCR" width="32" page="1" offset="0x66" internal="0" description="LPM Control Register">
		<bitfield id="LPM" description="Low Power Mode setting" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="QUALSTDBY" description="STANDBY Wakeup Pin Qualification Setting" begin="7" end="2" width="6" rwaccess="RW"/>
		<bitfield id="WDINTE" description="Enable for WDINT wakeup from STANDBY" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUID" width="32" page="1" offset="0x68" internal="0" description="Indicates CPU1 or CPU2">
		<bitfield id="CPUID" description="Indicates CPU1 or CPU2" begin="1" end="0" width="2" rwaccess="R"/>
	</register>
	<register id="CMPSSLPMSEL" width="32" page="1" offset="0x6c" internal="0" description="CMPSS LPM Wakeup select registers">
		<bitfield id="CMPSS1H" description="CMPSS1H Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1L" description="CMPSS1L Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2H" description="CMPSS2H Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2L" description="CMPSS2L Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3H" description="CMPSS3H Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3L" description="CMPSS3L Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4H" description="CMPSS4H Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4L" description="CMPSS4L Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5H" description="CMPSS5H Enable for LPM Wakeup" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5L" description="CMPSS5L Enable for LPM Wakeup" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6H" description="CMPSS6H Enable for LPM Wakeup" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6L" description="CMPSS6L Enable for LPM Wakeup" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7H" description="CMPSS7H Enable for LPM Wakeup" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7L" description="CMPSS7L Enable for LPM Wakeup" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8H" description="CMPSS8H Enable for LPM Wakeup" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8L" description="CMPSS8L Enable for LPM Wakeup" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9H" description="CMPSS9H Enable for LPM Wakeup" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9L" description="CMPSS9L Enable for LPM Wakeup" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10H" description="CMPSS10H Enable for LPM Wakeup" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10L" description="CMPSS10L Enable for LPM Wakeup" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11H" description="CMPSS11H Enable for LPM Wakeup" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11L" description="CMPSS11L Enable for LPM Wakeup" begin="21" end="21" width="1" rwaccess="RW"/>
	</register>
	<register id="GPIOLPMSEL0" width="32" page="1" offset="0x6e" internal="0" description="GPIO LPM Wakeup select registers">
		<bitfield id="GPIO0" description="GPIO0 Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO1" description="GPIO1 Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO2" description="GPIO2 Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO3" description="GPIO3 Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO4" description="GPIO4 Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO5" description="GPIO5 Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO6" description="GPIO6 Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO7" description="GPIO7 Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO8" description="GPIO8 Enable for LPM Wakeup" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO9" description="GPIO9 Enable for LPM Wakeup" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO10" description="GPIO10 Enable for LPM Wakeup" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO11" description="GPIO11 Enable for LPM Wakeup" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO12" description="GPIO12 Enable for LPM Wakeup" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO13" description="GPIO13 Enable for LPM Wakeup" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO14" description="GPIO14 Enable for LPM Wakeup" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO15" description="GPIO15 Enable for LPM Wakeup" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO16" description="GPIO16 Enable for LPM Wakeup" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO17" description="GPIO17 Enable for LPM Wakeup" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO18" description="GPIO18 Enable for LPM Wakeup" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO19" description="GPIO19 Enable for LPM Wakeup" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO20" description="GPIO20 Enable for LPM Wakeup" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO21" description="GPIO21 Enable for LPM Wakeup" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO22" description="GPIO22 Enable for LPM Wakeup" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="GPIO23 Enable for LPM Wakeup" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO24" description="GPIO24 Enable for LPM Wakeup" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="GPIO25 Enable for LPM Wakeup" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO26" description="GPIO26 Enable for LPM Wakeup" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO27" description="GPIO27 Enable for LPM Wakeup" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO28" description="GPIO28 Enable for LPM Wakeup" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO29" description="GPIO29 Enable for LPM Wakeup" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO30" description="GPIO30 Enable for LPM Wakeup" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="GPIO31 Enable for LPM Wakeup" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
