IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu1_sys_regs.xml
	<register id="GPIOLPMSEL1" width="32" page="1" offset="0x70" internal="0" description="GPIO LPM Wakeup select registers">
		<bitfield id="GPIO32" description="GPIO32 Enable for LPM Wakeup" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO33" description="GPIO33 Enable for LPM Wakeup" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO34" description="GPIO34 Enable for LPM Wakeup" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO35" description="GPIO35 Enable for LPM Wakeup" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO36" description="GPIO36 Enable for LPM Wakeup" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO37" description="GPIO37 Enable for LPM Wakeup" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO38" description="GPIO38 Enable for LPM Wakeup" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO39" description="GPIO39 Enable for LPM Wakeup" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO40" description="GPIO40 Enable for LPM Wakeup" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO41" description="GPIO41 Enable for LPM Wakeup" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO42" description="GPIO42 Enable for LPM Wakeup" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO43" description="GPIO43 Enable for LPM Wakeup" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO44" description="GPIO44 Enable for LPM Wakeup" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO45" description="GPIO45 Enable for LPM Wakeup" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="GPIO46 Enable for LPM Wakeup" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO47" description="GPIO47 Enable for LPM Wakeup" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO48" description="GPIO48 Enable for LPM Wakeup" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO49" description="GPIO49 Enable for LPM Wakeup" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO50" description="GPIO50 Enable for LPM Wakeup" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO51" description="GPIO51 Enable for LPM Wakeup" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO52" description="GPIO52 Enable for LPM Wakeup" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO53" description="GPIO53 Enable for LPM Wakeup" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO54" description="GPIO54 Enable for LPM Wakeup" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO55" description="GPIO55 Enable for LPM Wakeup" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO56" description="GPIO56 Enable for LPM Wakeup" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO57" description="GPIO57 Enable for LPM Wakeup" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO58" description="GPIO58 Enable for LPM Wakeup" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO59" description="GPIO59 Enable for LPM Wakeup" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO60" description="GPIO60 Enable for LPM Wakeup" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO61" description="GPIO61 Enable for LPM Wakeup" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO62" description="GPIO62 Enable for LPM Wakeup" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO63" description="GPIO63 Enable for LPM Wakeup" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TMR2CLKCTL" width="32" page="1" offset="0x72" internal="0" description="Timer2 Clock Measurement functionality control register">
		<bitfield id="TMR2CLKSRCSEL" description="CPU Timer 2 Clock Source Select Bit" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="TMR2CLKPRESCALE" description="CPU Timer 2 Clock Pre-Scale Value" begin="5" end="3" width="3" rwaccess="RW"/>
	</register>
	<register id="RESCCLR" width="32" page="1" offset="0x74" internal="0" description="Reset Cause Clear Register">
		<bitfield id="POR" description="POR Reset Cause Indication Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="XRSn" description="XRSn Reset Cause Indication Bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="WDRSn" description="WDRSn Reset Cause Indication Bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="NMIWDRSn" description="NMIWDRSn Reset Cause Indication Bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="HWBISTn" description="HWBISTn Reset Cause Indication Bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SCCRESETn" description="SCCRESETn Reset Cause Indication Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ECAT_RESET_OUT" description="ECAT_RESET_OUT Reset Cause Indication Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SIMRESET_CPU1RSn" description="SIMRESET_CPU1RSn Reset Cause Indication Bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SIMRESET_XRSn" description="SIMRESET_XRSn Reset Cause Indication Bit" begin="11" end="11" width="1" rwaccess="RW"/>
	</register>
	<register id="RESC" width="32" page="1" offset="0x76" internal="0" description="Reset Cause register">
		<bitfield id="POR" description="POR Reset Cause Indication Bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="XRSn" description="XRSn Reset Cause Indication Bit" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="WDRSn" description="WDRSn Reset Cause Indication Bit" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="NMIWDRSn" description="NMIWDRSn Reset Cause Indication Bit" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="HWBISTn" description="HWBISTn Reset Cause Indication Bit" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SCCRESETn" description="SCCRESETn Reset Cause Indication Bit" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="ECAT_RESET_OUT" description="ECAT_RESET_OUT Reset Cause Indication Bit" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SIMRESET_CPU1RSn" description="SIMRESET_CPU1RSn Reset Cause Indication Bit" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SIMRESET_XRSn" description="SIMRESET_XRSn Reset Cause Indication Bit" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="XRSn_pin_status" description="XRSN Pin Status" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="DCON" description="Debugger conntion status to C28x" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUS" width="32" page="1" offset="0x8e" internal="0" description="MCAN Wake Status Register">
		<bitfield id="WAKE_MCANA" description="MCANA Wake Status " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCANB" description="MCANB Wake Status " begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUSCLR" width="32" page="1" offset="0x90" internal="0" description="MCAN Wake Status Clear Register">
		<bitfield id="WAKE_MCANA" description="Cear bit for MCANWAKESTATUS.WAKE_MCANA bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCANB" description="Cear bit for MCANWAKESTATUS.WAKE_MCANB bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPREQ" width="32" page="1" offset="0x92" internal="0" description="Peripheral Clock Stop Request Register">
		<bitfield id="CAN_A" description="CAN_A Clock Stop Request Bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Request Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Stop Request Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for register write " begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPACK" width="32" page="1" offset="0x94" internal="0" description="Peripheral Clock Stop Ackonwledge Register">
		<bitfield id="CAN_A" description="CAN_A Clock Stop Ack Bit" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Ack Bit" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Stop Ack Bit" begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="USER_REG1_SYSRSn" width="32" page="1" offset="0x96" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_SYSRSn" width="32" page="1" offset="0x98" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
