IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu1_sys_regs.xml
	<register id="USER_REG1_XRSn" width="32" page="1" offset="0x9a" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_XRSn" width="32" page="1" offset="0x9c" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_PORESETn" width="32" page="1" offset="0x9e" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_PORESETn" width="32" page="1" offset="0xa0" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG3_PORESETn" width="32" page="1" offset="0xa2" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG4_PORESETn" width="32" page="1" offset="0xa4" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="JTAG_MMR_REG" width="32" page="1" offset="0xa6" internal="0" description="Readback of JTAG registers for test purpose">
	</register>
</module>
